Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/pmc.h
#define PMC_CSR3_PID_Pos                      _UINT32_(0)                                          /* (PMC_CSR3 Position) Peripheral Clock 96 Status */
#define PMC_CSR3_PID_Msk                      (_UINT32_(0x1) << PMC_CSR3_PID_Pos)                  /* (PMC_CSR3 Mask) PID */
#define PMC_CSR3_PID(value)                   (PMC_CSR3_PID_Msk & (_UINT32_(value) << PMC_CSR3_PID_Pos)) 

/* -------- PMC_GCSR0 : (PMC Offset: 0xC4) ( R/ 32) Generic Clock Status Register 0 -------- */
#define PMC_GCSR0_GPID9_Pos                   _UINT32_(9)                                          /* (PMC_GCSR0) Generic Clock 9 Status Position */
#define PMC_GCSR0_GPID9_Msk                   (_UINT32_(0x1) << PMC_GCSR0_GPID9_Pos)               /* (PMC_GCSR0) Generic Clock 9 Status Mask */
#define PMC_GCSR0_GPID9(value)                (PMC_GCSR0_GPID9_Msk & (_UINT32_(value) << PMC_GCSR0_GPID9_Pos)) /* Assigment of value for GPID9 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID10_Pos                  _UINT32_(10)                                         /* (PMC_GCSR0) Generic Clock 10 Status Position */
#define PMC_GCSR0_GPID10_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID10_Pos)              /* (PMC_GCSR0) Generic Clock 10 Status Mask */
#define PMC_GCSR0_GPID10(value)               (PMC_GCSR0_GPID10_Msk & (_UINT32_(value) << PMC_GCSR0_GPID10_Pos)) /* Assigment of value for GPID10 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID11_Pos                  _UINT32_(11)                                         /* (PMC_GCSR0) Generic Clock 11 Status Position */
#define PMC_GCSR0_GPID11_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID11_Pos)              /* (PMC_GCSR0) Generic Clock 11 Status Mask */
#define PMC_GCSR0_GPID11(value)               (PMC_GCSR0_GPID11_Msk & (_UINT32_(value) << PMC_GCSR0_GPID11_Pos)) /* Assigment of value for GPID11 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID12_Pos                  _UINT32_(12)                                         /* (PMC_GCSR0) Generic Clock 12 Status Position */
#define PMC_GCSR0_GPID12_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID12_Pos)              /* (PMC_GCSR0) Generic Clock 12 Status Mask */
#define PMC_GCSR0_GPID12(value)               (PMC_GCSR0_GPID12_Msk & (_UINT32_(value) << PMC_GCSR0_GPID12_Pos)) /* Assigment of value for GPID12 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID13_Pos                  _UINT32_(13)                                         /* (PMC_GCSR0) Generic Clock 13 Status Position */
#define PMC_GCSR0_GPID13_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID13_Pos)              /* (PMC_GCSR0) Generic Clock 13 Status Mask */
#define PMC_GCSR0_GPID13(value)               (PMC_GCSR0_GPID13_Msk & (_UINT32_(value) << PMC_GCSR0_GPID13_Pos)) /* Assigment of value for GPID13 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID14_Pos                  _UINT32_(14)                                         /* (PMC_GCSR0) Generic Clock 14 Status Position */
#define PMC_GCSR0_GPID14_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID14_Pos)              /* (PMC_GCSR0) Generic Clock 14 Status Mask */
#define PMC_GCSR0_GPID14(value)               (PMC_GCSR0_GPID14_Msk & (_UINT32_(value) << PMC_GCSR0_GPID14_Pos)) /* Assigment of value for GPID14 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID15_Pos                  _UINT32_(15)                                         /* (PMC_GCSR0) Generic Clock 15 Status Position */
#define PMC_GCSR0_GPID15_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID15_Pos)              /* (PMC_GCSR0) Generic Clock 15 Status Mask */
#define PMC_GCSR0_GPID15(value)               (PMC_GCSR0_GPID15_Msk & (_UINT32_(value) << PMC_GCSR0_GPID15_Pos)) /* Assigment of value for GPID15 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID16_Pos                  _UINT32_(16)                                         /* (PMC_GCSR0) Generic Clock 16 Status Position */
#define PMC_GCSR0_GPID16_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID16_Pos)              /* (PMC_GCSR0) Generic Clock 16 Status Mask */
#define PMC_GCSR0_GPID16(value)               (PMC_GCSR0_GPID16_Msk & (_UINT32_(value) << PMC_GCSR0_GPID16_Pos)) /* Assigment of value for GPID16 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID23_Pos                  _UINT32_(23)                                         /* (PMC_GCSR0) Generic Clock 23 Status Position */
#define PMC_GCSR0_GPID23_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID23_Pos)              /* (PMC_GCSR0) Generic Clock 23 Status Mask */
#define PMC_GCSR0_GPID23(value)               (PMC_GCSR0_GPID23_Msk & (_UINT32_(value) << PMC_GCSR0_GPID23_Pos)) /* Assigment of value for GPID23 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID24_Pos                  _UINT32_(24)                                         /* (PMC_GCSR0) Generic Clock 24 Status Position */
#define PMC_GCSR0_GPID24_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID24_Pos)              /* (PMC_GCSR0) Generic Clock 24 Status Mask */
#define PMC_GCSR0_GPID24(value)               (PMC_GCSR0_GPID24_Msk & (_UINT32_(value) << PMC_GCSR0_GPID24_Pos)) /* Assigment of value for GPID24 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID31_Pos                  _UINT32_(31)                                         /* (PMC_GCSR0) Generic Clock 31 Status Position */
#define PMC_GCSR0_GPID31_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID31_Pos)              /* (PMC_GCSR0) Generic Clock 31 Status Mask */
#define PMC_GCSR0_GPID31(value)               (PMC_GCSR0_GPID31_Msk & (_UINT32_(value) << PMC_GCSR0_GPID31_Pos)) /* Assigment of value for GPID31 in the PMC_GCSR0 register */
#define PMC_GCSR0_Msk                         _UINT32_(0x8181FE00)                                 /* (PMC_GCSR0) Register Mask  */

#define PMC_GCSR0_GPID_Pos                    _UINT32_(9)                                          /* (PMC_GCSR0 Position) Generic Clock 3x Status */
#define PMC_GCSR0_GPID_Msk                    (_UINT32_(0x7FF) << PMC_GCSR0_GPID_Pos)              /* (PMC_GCSR0 Mask) GPID */
#define PMC_GCSR0_GPID(value)                 (PMC_GCSR0_GPID_Msk & (_UINT32_(value) << PMC_GCSR0_GPID_Pos)) 

/* -------- PMC_GCSR1 : (PMC Offset: 0xC8) ( R/ 32) Generic Clock Status Register 1 -------- */
#define PMC_GCSR1_GPID34_Pos                  _UINT32_(2)                                          /* (PMC_GCSR1) Generic Clock 34 Status Position */
#define PMC_GCSR1_GPID34_Msk                  (_UINT32_(0x1) << PMC_GCSR1_GPID34_Pos)              /* (PMC_GCSR1) Generic Clock 34 Status Mask */
#define PMC_GCSR1_GPID34(value)               (PMC_GCSR1_GPID34_Msk & (_UINT32_(value) << PMC_GCSR1_GPID34_Pos)) /* Assigment of value for GPID34 in the PMC_GCSR1 register */
#define PMC_GCSR1_GPID37_Pos                  _UINT32_(5)                                          /* (PMC_GCSR1) Generic Clock 37 Status Position */
#define PMC_GCSR1_GPID37_Msk                  (_UINT32_(0x1) << PMC_GCSR1_GPID37_Pos)              /* (PMC_GCSR1) Generic Clock 37 Status Mask */
#define PMC_GCSR1_GPID37(value)               (PMC_GCSR1_GPID37_Msk & (_UINT32_(value) << PMC_GCSR1_GPID37_Pos)) /* Assigment of value for GPID37 in the PMC_GCSR1 register */
#define PMC_GCSR1_Msk                         _UINT32_(0x00000024)                                 /* (PMC_GCSR1) Register Mask  */

